---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CannotPlaceFabricArea
source: html/0f03d92e-8373-976e-6b6d-52c7ac072369.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CannotPlaceFabricArea Property

Can't find a host for Fabric Area.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlaceFabricArea { get; }
```